update knowledge
